---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.DesignOptionAndWorksetViolation
source: html/01402346-36db-2c1a-390b-54c421b918a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.DesignOptionAndWorksetViolation Property

Can't make the expected join because of editability and design option restrictions.

## Syntax (C#)
```csharp
public static FailureDefinitionId DesignOptionAndWorksetViolation { get; }
```